interfaces/src/main/resources/templates/GeefWerkrelaties/02.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://webservice.geefwerkrelatiesdienst-02_00.werk-02_00.vip.vlaanderen.be">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefWerkrelaties>
            <Verzoek>
                <Context>
                    <Naam>GeefWerkrelaties</Naam>
                    <Versie>02.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <TypeAntwoord>0</TypeAntwoord>
                            <Criteria>
                                <Relatie>
                                    <Werknemer>
                                        <INSZ>90010100123</INSZ>
                                    </Werknemer>
                                </Relatie>
                                <Bron>RSZ</Bron>
                                <Periode>
                                    <Begin>2025-01-01</Begin>
                                    <Einde>2026-01-01</Einde>
                                </Periode>
                                <EnkelGestartOfBeeindigd>0</EnkelGestartOfBeeindigd>
                                <SchrappingsIndicatie>0</SchrappingsIndicatie>
                                <InterimIndicatie>0</InterimIndicatie>
                            </Criteria>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefWerkrelaties>
    </soapenv:Body>
</soapenv:Envelope>